velioo_webserver/tests/ab_test_application_async_SMALL_POST_BIG_TIMEOUT2.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Velioo's
Server Hostname:        localhost
Server Port:            8887

Document Path:          /application
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   1.627 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      266000 bytes
Total body sent:        215000
HTML transferred:       136000 bytes
Requests per second:    614.73 [#/sec] (mean)
Time per request:       162.673 [ms] (mean)
Time per request:       1.627 [ms] (mean, across all concurrent requests)
Transfer rate:          159.69 [Kbytes/sec] received
                        129.07 kb/s sent
                        288.76 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.0      1       4
Processing:   148  161  10.0    161     184
Waiting:       22   71  28.0     71     140
Total:        150  162  10.1    161     188

Percentage of the requests served within a certain time (ms)
  50%    161
  66%    162
  75%    168
  80%    172
  90%    183
  95%    183
  98%    183
  99%    183
 100%    188 (longest request)

Server Global, local Timeout: 30s