velioo_webserver/tests/wrk_application_test12.txt
Running 10s test @ http://127.0.0.1:8888/application
  25 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   745.14ms  489.17ms   1.90s    63.30%
    Req/Sec    23.92     30.34   141.00     85.34%
  610 requests in 10.10s, 119.74KB read
  Socket errors: connect 0, read 110, write 0, timeout 95
Requests/sec:     60.40
Transfer/sec:     11.86KB