velioo_webserver/tests/wrk_cgi_async_test4.txt
Running 1m test @ http://localhost:8887/cgi-bin/app/test.py
  10 threads and 30 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.51s   493.00ms   4.27s    67.43%
    Req/Sec     2.33      3.12    20.00     89.69%
  700 requests in 1.00m, 107.10KB read
Requests/sec:     11.65
Transfer/sec:      1.78KB

wrk timeout = 5 seconds