velioo_webserver/tests/wrk_cgi_test11.txt
Running 1m test @ http://localhost:8888/cgi-bin/app/test.py
  100 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.84s     4.45s   20.03s    81.62%
    Req/Sec     1.67      2.90    10.00     84.11%
  631 requests in 1.00m, 83.75KB read
Requests/sec:     10.50
Transfer/sec:      1.39KB

timeout = 30s